Процедура ОбработкаПроведения(Отказ,Режим)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	// регистр ОстаткиТовараЗадача_2
	Движения.ОстаткиТовараЗадача_2.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиТовараЗадача_2.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗадача_2Товары.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗадача_2Товары.Количество КАК Количество,
	|	РасходнаяНакладнаяЗадача_2.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РасходнаяНакладнаяЗадача_2.Товары КАК РасходнаяНакладнаяЗадача_2Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладнаяЗадача_2 КАК РасходнаяНакладнаяЗадача_2
	|		ПО РасходнаяНакладнаяЗадача_2Товары.Ссылка = РасходнаяНакладнаяЗадача_2.Ссылка
	|ГДЕ
	|	РасходнаяНакладнаяЗадача_2Товары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Склад КАК Склад,
	|	ЕСТЬNULL(ОстаткиТовараЗадача_2Остатки.КоличествоОстаток, 0) - ВТ_Товары.Количество КАК ОстатокПослеРасхода
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовараЗадача_2.Остатки КАК ОстаткиТовараЗадача_2Остатки
	|		ПО ВТ_Товары.Номенклатура = ОстаткиТовараЗадача_2Остатки.Номенклатура
	|		И ВТ_Товары.Склад = ОстаткиТовараЗадача_2Остатки.Склад";
	
	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если  Выборка.ОстатокПослеРасхода < 0 Тогда
			Сообщить("Номенклатура " + Выборка.Номенклатура + " не хватает на складе " + Выборка.Склад + " на " + (-Выборка.ОстатокПослеРасхода) + " шт.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
		
	
КонецПроцедуры