Процедура ОбработкаПроведения(Отказ,Режим)

	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	// регистр РегистрНакопления
	Движения.ОстаткиТовараЗадача_1.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиТовараЗадача_1.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗадача_1Товары.Товар КАК Товар,
	|	РасходнаяНакладнаяЗадача_1Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РасходнаяНакладнаяЗадача_1.Товары КАК РасходнаяНакладнаяЗадача_1Товары
	|ГДЕ
	|	РасходнаяНакладнаяЗадача_1Товары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос2 = Новый Запрос();
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|    ВТ_Товары.Товар КАК Номенклатура,
	|    ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ВТ_Товары.Количество КАК ОстатокПослеРасхода
	|ИЗ
	|    ВТ_Товары КАК ВТ_Товары
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовараЗадача_1.Остатки() КАК Остатки
	|        ПО ВТ_Товары.Товар = Остатки.Номенклатура";
	
	Выборка = Запрос2.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
	
		Если Выборка.ОстатокПослеРасхода < 0 Тогда
			Сообщить("Не хватает товара: " + Выборка.Номенклатура + " на " + (-Выборка.ОстатокПослеРасхода) + " шт.");
			Отказ = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
	
КонецПроцедуры