Процедура ОбработкаПроведения(Отказ,Режим)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	// регистр ОстаткиТовараЗадача_4
	Движения.ОстаткиТовараЗадача_4.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиТовараЗадача_4.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр ПродажиТовараЗадача_4
	Движения.ПродажиТовараЗадача_4.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ПродажиТовараЗадача_4.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗадача_4Товары.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗадача_4Товары.Количество КАК Количество,
	|	РасходнаяНакладнаяЗадача_4Товары.Сумма КАК Сумма,
	|	РасходнаяНакладнаяЗадача_4.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РасходнаяНакладнаяЗадача_4.Товары КАК РасходнаяНакладнаяЗадача_4Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладнаяЗадача_4 КАК РасходнаяНакладнаяЗадача_4
	|		ПО РасходнаяНакладнаяЗадача_4Товары.Ссылка = РасходнаяНакладнаяЗадача_4.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();

	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Склад КАК Склад,
	|	ЕСТЬNULL(ОстаткиТовараЗадача_4Остатки.КоличествоОстаток, 0) - ВТ_Товары.Количество КАК ОстатокПослеРасхода
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовараЗадача_4.Остатки КАК ОстаткиТовараЗадача_4Остатки
	|		ПО ВТ_Товары.Номенклатура = ОстаткиТовараЗадача_4Остатки.Номенклатура
	|		И ВТ_Товары.Склад = ОстаткиТовараЗадача_4Остатки.Склад";
	
	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОстатокПослеРасхода < 0 Тогда
			Сообщить("Номенклатура " + Выборка.Номенклатура + " не хватает на складе " + Выборка.Склад + " на " + (-Выборка.ОстатокПослеРасхода) + " шт.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры